package DZ_16.Task3;

public class Main {
    public static void main(String[] args) {
        //Задана строка, которая можем иметь внутри себя скобки. Скобкой считается любой из следующих символов: (,),{,},[,].
        //Проверить сбалансированность расстановки скобок в этой строке. Набор скобок считается сбалансированной парой если
        //открывающаяся скобка стоит слева от соответствующей закрывающей скобки. Строка содержащая пары скобок, не сбалансирована,
        //если набор заключенных в нее скобок не совпадает.
        //Например, если ввод "{[(])}" пара квадратных скобок заключает в себя одну несбалансированную открывающуюся скобку.
        //Аналогично, пара круглых скобок содержат в себе закрывающую квадратную скобку. Таким образом строка несбалансирована.
        String brackets = "{([])([][])}";

    }
}
