package DZ_8.Task_hard;

public class Main {
    public static void main(String[] args) {
        /** Задача *:
         Написать такой конструктор, который запретит создание объекта класса Dog в других
         классах; Найти способ вызывать методы voice(), eat() класса Dog, который позволит
         обойти ограничение, наложенное конструктором выше. Объяснить, как работают оба
         способа */

        // Dog dog = new Dog();   // не дает создать объект т.к. конструктор private

        Dog.eat("Meat");    //можно обратиться к методам класса Dog без создания объекта т.к. эти методы static.
        Dog.voice();
    }
}
